{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "bias": true, "trainable": true, "name": "convolution2d_1", "border_mode": "valid", "nb_col": 1, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 1, "init": "he_normal", "activation": "linear", "W_constraint": null, "batch_input_shape": [null, 160, 320, 1], "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 3, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_2", "border_mode": "valid", "nb_col": 8, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 8, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 24, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_3", "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 5, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 36, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_4", "border_mode": "valid", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 5, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 48, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_5", "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 3, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_4", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_4"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_6", "border_mode": "valid", "nb_col": 2, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "nb_row": 2, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_5", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 1536, "trainable": true, "bias": true, "name": "dense_1", "output_dim": 1024, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dense", "config": {"input_dim": 1024, "trainable": true, "bias": true, "name": "dense_2", "output_dim": 512, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_7"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dense", "config": {"input_dim": 512, "trainable": true, "bias": true, "name": "dense_3", "output_dim": 256, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_8"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"input_dim": 256, "trainable": true, "bias": true, "name": "dense_4", "output_dim": 128, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_9"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"input_dim": 128, "trainable": true, "bias": true, "name": "dense_5", "output_dim": 32, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "he_normal", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_10"}}, {"class_name": "Dense", "config": {"input_dim": 32, "trainable": true, "bias": true, "name": "dense_6", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "activity_regularizer": null}}], "keras_version": "1.2.0"}