{"config": [{"config": {"activation": "linear", "nb_filter": 3, "nb_row": 1, "input_dtype": "float32", "W_regularizer": null, "nb_col": 1, "b_constraint": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "batch_input_shape": [null, 160, 320, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "linear", "nb_filter": 24, "nb_row": 8, "W_regularizer": null, "nb_col": 8, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "name": "convolution2d_2", "subsample": [1, 1], "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"activation": "linear", "nb_filter": 36, "nb_row": 5, "W_regularizer": null, "nb_col": 5, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "name": "convolution2d_3", "subsample": [1, 1], "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"activation": "linear", "nb_filter": 48, "nb_row": 5, "W_regularizer": null, "nb_col": 5, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"activation": "linear", "nb_filter": 64, "nb_row": 3, "W_regularizer": null, "nb_col": 3, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "name": "convolution2d_5", "subsample": [1, 1], "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activation": "linear", "nb_filter": 64, "nb_row": 2, "W_regularizer": null, "nb_col": 2, "b_constraint": null, "dim_ordering": "tf", "bias": true, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "init": "he_normal", "name": "convolution2d_6", "subsample": [1, 1], "b_regularizer": null, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_5", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "output_dim": 1024, "W_regularizer": null, "input_dim": 1536, "b_constraint": null, "bias": true, "name": "dense_1", "activity_regularizer": null, "init": "he_normal", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 512, "W_regularizer": null, "input_dim": 1024, "b_constraint": null, "bias": true, "name": "dense_2", "activity_regularizer": null, "init": "he_normal", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_7", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 256, "W_regularizer": null, "input_dim": 512, "b_constraint": null, "bias": true, "name": "dense_3", "activity_regularizer": null, "init": "he_normal", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_8", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 128, "W_regularizer": null, "input_dim": 256, "b_constraint": null, "bias": true, "name": "dense_4", "activity_regularizer": null, "init": "he_normal", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_9", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 32, "W_regularizer": null, "input_dim": 128, "b_constraint": null, "bias": true, "name": "dense_5", "activity_regularizer": null, "init": "he_normal", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_10", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "class_name": "ELU"}, {"config": {"activation": "linear", "output_dim": 1, "W_regularizer": null, "input_dim": 32, "b_constraint": null, "bias": true, "name": "dense_6", "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}