{"config": [{"config": {"nb_row": 1, "b_constraint": null, "nb_filter": 3, "input_dtype": "float32", "name": "convolution2d_1", "b_regularizer": null, "nb_col": 1, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 66, 200, 1], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "b_constraint": null, "nb_filter": 24, "input_dtype": "float32", "name": "convolution2d_2", "b_regularizer": null, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 66, 200, 3], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "b_constraint": null, "nb_filter": 36, "input_dtype": "float32", "name": "convolution2d_3", "b_regularizer": null, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 31, 98, 24], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "b_constraint": null, "nb_filter": 48, "input_dtype": "float32", "name": "convolution2d_4", "b_regularizer": null, "nb_col": 5, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 14, 47, 36], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "same", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "b_constraint": null, "nb_filter": 64, "input_dtype": "float32", "name": "convolution2d_5", "b_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 5, 22, 48], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "b_constraint": null, "nb_filter": 64, "input_dtype": "float32", "name": "convolution2d_6", "b_regularizer": null, "nb_col": 3, "activation": "linear", "subsample": [1, 1], "batch_input_shape": [null, 3, 20, 64], "trainable": true, "bias": true, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "b_constraint": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 1152, "W_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"output_dim": 50, "b_constraint": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"output_dim": 10, "b_constraint": null, "b_regularizer": null, "init": "he_normal", "activation": "linear", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 50, "W_constraint": null, "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"output_dim": 1, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}