{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>x\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 1, "activation": "linear", "activity_regularizer": null, "nb_filter": 3, "bias": true, "name": "convolution2d_1", "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 1, "subsample": [1, 1], "init": "he_normal", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_1", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "nb_filter": 32, "bias": true, "name": "convolution2d_2", "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "subsample": [1, 1], "init": "he_normal", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_2", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "nb_filter": 64, "bias": true, "name": "convolution2d_3", "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_3", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "nb_filter": 128, "bias": true, "name": "convolution2d_4", "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_4", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "trainable": true, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "nb_filter": 256, "bias": true, "name": "convolution2d_5", "W_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "init": "he_normal", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_5", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "activation": "linear", "input_dim": 1024, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_6", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 256, "trainable": true, "activation": "linear", "input_dim": 512, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_7", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 128, "trainable": true, "activation": "linear", "input_dim": 256, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_8", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 16, "trainable": true, "activation": "linear", "input_dim": 128, "W_constraint": null, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_4"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "name": "batchnormalization_9", "trainable": true, "momentum": 0.99, "mode": 1, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "activation": "linear", "input_dim": 16, "W_constraint": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-06}, "bias": true, "init": "he_normal", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_5"}}]}