{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "output_shape": null, "arguments": {}, "input_dtype": "float32", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 1, "dim_ordering": "tf", "name": "convolution2d_1", "subsample": [1, 1], "W_regularizer": null, "nb_col": 1, "b_regularizer": null, "border_mode": "valid", "nb_filter": 3, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_2", "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 32, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_3", "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 32, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_4", "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_5", "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 128, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_6", "subsample": [1, 1], "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "nb_col": 3, "b_regularizer": null, "border_mode": "valid", "nb_filter": 256, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 512, "name": "dense_1", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 1024, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 256, "name": "dense_2", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 512, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 128, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 256, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 64, "name": "dense_4", "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "b_constraint": null, "input_dim": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "elu", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 16, "name": "dense_5", "W_regularizer": {"l2": 9.999999747378752e-05, "l1": 0.0, "name": "L1L2Regularizer"}, "b_regularizer": null, "b_constraint": null, "input_dim": 64, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "name": "dense_6", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "input_dim": 16, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}