{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "arguments": {}, "name": "lambda_1", "output_shape": null, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "nb_col": 1, "nb_filter": 3, "activity_regularizer": null, "W_constraint": null, "activation": "linear", "name": "convolution2d_1", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 1, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "nb_filter": 32, "activity_regularizer": null, "W_constraint": null, "activation": "elu", "name": "convolution2d_2", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "nb_filter": 32, "activity_regularizer": null, "W_constraint": null, "activation": "elu", "name": "convolution2d_3", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "activation": "elu", "name": "convolution2d_4", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "nb_filter": 128, "activity_regularizer": null, "W_constraint": null, "activation": "elu", "name": "convolution2d_5", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "nb_col": 3, "nb_filter": 256, "activity_regularizer": null, "W_constraint": null, "activation": "elu", "name": "convolution2d_6", "subsample": [1, 1], "bias": true, "border_mode": "valid", "init": "glorot_uniform", "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 1024, "b_constraint": null, "output_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "b_constraint": null, "output_dim": 256}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 256, "b_constraint": null, "output_dim": 128}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 128, "b_constraint": null, "output_dim": 64}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-05}, "activation": "elu", "activity_regularizer": null, "W_constraint": null, "name": "dense_5", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 64, "b_constraint": null, "output_dim": 16}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "name": "dense_6", "bias": true, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 16, "b_constraint": null, "output_dim": 1}}]}