{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 32, 64, 1], "name": "lambda_1", "function_type": "lambda", "output_shape": null, "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u001f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 1, "activation": "linear", "nb_col": 1, "init": "he_normal", "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 3, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_1", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 5, "activation": "linear", "nb_col": 5, "init": "he_normal", "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_2", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 5, "activation": "linear", "nb_col": 5, "init": "he_normal", "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_3", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 5, "activation": "linear", "nb_col": 5, "init": "he_normal", "W_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "nb_filter": 128, "b_constraint": null, "W_regularizer": null, "bias": true, "name": "convolution2d_4", "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "b_constraint": null, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1024, "bias": true, "W_regularizer": null, "input_dim": 1152, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "b_constraint": null, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 256, "bias": true, "W_regularizer": null, "input_dim": 1024, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "b_constraint": null, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "W_regularizer": null, "input_dim": 256, "name": "dense_3"}}]}